mobizt/ESP32-Mail-Client/src/ssl_client32.cpp
/*
 *Customized ssl_client.cpp to support STARTTLS protocol, version 1.0.2
 * 
 * The MIT License (MIT)
 * Copyright (c) 2019 K. Suwatchai (Mobizt)
 * 
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/* Provide SSL/TLS functions to ESP32 with Arduino IDE
*
* Adapted from the ssl_client1 example of mbedtls.
*
* Original Copyright (C) 2006-2015, ARM Limited, All Rights Reserved, Apache 2.0 License.
* Additions Copyright (C) 2017 Evandro Luis Copercini, Apache 2.0 License.
*/

#include "Arduino.h"
#include <esp32-hal-log.h>
#include <lwip/err.h>
#include <lwip/sockets.h>
#include <lwip/sys.h>
#include <lwip/netdb.h>
#include <mbedtls/sha256.h>
#include <mbedtls/oid.h>
#include <algorithm>
#include <string>
#include "ssl_client32.h"
#include "WiFi.h"

const char *pers32 = "esp32-tls";

static int handle_error(int err)
{
    if (err == -30848)
    {
        return err;
    }
#ifdef MBEDTLS_ERROR_C
    char error_buf[100];
    mbedtls_strerror(err, error_buf, 100);
    log_e("%s", error_buf);
#endif
    log_e("MbedTLS message code: %d", err);
    return err;
}

void ssl_init(sslclient_context32 *ssl_client)
{
    mbedtls_ssl_init(&ssl_client->ssl_ctx);
    mbedtls_ssl_config_init(&ssl_client->ssl_conf);
    mbedtls_ctr_drbg_init(&ssl_client->drbg_ctx);
    mbedtls_net_init(&ssl_client->server_fd);
}

int start_ssl_client(sslclient_context32 *ssl_client, const char *host, uint32_t port, int timeout, const char *rootCABuff, const char *cli_cert, const char *cli_key, const char *pskIdent, const char *psKey)
{
    char buf[512];
    int ret, flags;
    int enable = 1;

    if (ssl_client->_debugCallback)
        ssl_client->_debugCallback(FPSTR("INFO: starting socket"));

    log_v("Free internal heap before TLS %u", ESP.getFreeHeap());

    log_v("Starting socket");
    ssl_client->socket = -1;

    ssl_client->socket = lwip_socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (ssl_client->socket < 0)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: opening socket"));
        log_e("ERROR opening socket");
        return ssl_client->socket;
    }

    IPAddress srv((uint32_t)0);
    if (!WiFiGenericClass::hostByName(host, srv))
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: could not get ip from host"));
        return -1;
    }

    struct sockaddr_in serv_addr;
    memset(&serv_addr, 0, sizeof(serv_addr));
    serv_addr.sin_family = AF_INET;
    serv_addr.sin_addr.s_addr = srv;
    serv_addr.sin_port = htons(port);

    if (ssl_client->_debugCallback)
        ssl_client->_debugCallback(FPSTR("INFO: connecting to Server..."));

    if (lwip_connect(ssl_client->socket, (struct sockaddr *)&serv_addr, sizeof(serv_addr)) == 0)
    {
        if (timeout <= 0)
        {
            timeout = 30000;
        }
        lwip_setsockopt(ssl_client->socket, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));
        lwip_setsockopt(ssl_client->socket, SOL_SOCKET, SO_SNDTIMEO, &timeout, sizeof(timeout));
        lwip_setsockopt(ssl_client->socket, IPPROTO_TCP, TCP_NODELAY, &enable, sizeof(enable));
        lwip_setsockopt(ssl_client->socket, SOL_SOCKET, SO_KEEPALIVE, &enable, sizeof(enable));

        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: server connected"));
    }
    else
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: connect to Server failed!"));
        log_e("Connect to Server failed!");
        return -1;
    }

    fcntl(ssl_client->socket, F_SETFL, fcntl(ssl_client->socket, F_GETFL, 0) | O_NONBLOCK);

    if (ssl_client->starttls && (port == 25 || port == 587 || port == 143))
    {

        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: begin STARTTLS handshake"));

        if ((ret = starttlsHandshake(ssl_client, port)) != 0)
        {
            log_e("STARTTLS failed!");
            return -1;
        }
    }

    if (ssl_client->_debugCallback)
        ssl_client->_debugCallback(FPSTR("INFO: seeding the random number generator"));

    log_v("Seeding the random number generator");
    mbedtls_entropy_init(&ssl_client->entropy_ctx);

    ret = mbedtls_ctr_drbg_seed(&ssl_client->drbg_ctx, mbedtls_entropy_func,
                                &ssl_client->entropy_ctx, (const unsigned char *)pers32, strlen(pers32));
    if (ret < 0)
    {
        if (ssl_client->_debugCallback)
        {
            char *error_buf = new char[100];
            memset(buf, 0, 512);
            strcpy_P(buf, FPSTR("ERROR: "));
            mbedtls_strerror(ret, error_buf, 100);
            strcat(buf, error_buf);
            ssl_client->_debugCallback(buf);
            delete[] error_buf;
        }

        return handle_error(ret);
    }

    if (ssl_client->_debugCallback)
        ssl_client->_debugCallback(FPSTR("INFO: setting up the SSL/TLS structure..."));

    log_v("Setting up the SSL/TLS structure...");

    if ((ret = mbedtls_ssl_config_defaults(&ssl_client->ssl_conf,
                                           MBEDTLS_SSL_IS_CLIENT,
                                           MBEDTLS_SSL_TRANSPORT_STREAM,
                                           MBEDTLS_SSL_PRESET_DEFAULT)) != 0)
    {
        if (ssl_client->_debugCallback)
        {
            char *error_buf = new char[100];
            memset(buf, 0, 512);
            strcpy_P(buf, FPSTR("ERROR: "));
            mbedtls_strerror(ret, error_buf, 100);
            strcat(buf, error_buf);
            ssl_client->_debugCallback(buf);
            delete[] error_buf;
        }
        return handle_error(ret);
    }

    // MBEDTLS_SSL_VERIFY_REQUIRED if a CA certificate is defined on Arduino IDE and
    // MBEDTLS_SSL_VERIFY_NONE if not.

