mobizt/ESP32-Mail-Client/src/ssl_client32.cpp
    if (rootCABuff != NULL)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: loading CA cert"));
        log_v("Loading CA cert");
        mbedtls_x509_crt_init(&ssl_client->ca_cert);
        mbedtls_ssl_conf_authmode(&ssl_client->ssl_conf, MBEDTLS_SSL_VERIFY_REQUIRED);
        ret = mbedtls_x509_crt_parse(&ssl_client->ca_cert, (const unsigned char *)rootCABuff, strlen(rootCABuff) + 1);
        mbedtls_ssl_conf_ca_chain(&ssl_client->ssl_conf, &ssl_client->ca_cert, NULL);
        //mbedtls_ssl_conf_verify(&ssl_client->ssl_ctx, my_verify, NULL );
        if (ret < 0)
        {
            if (ssl_client->_debugCallback)
            {
                char *error_buf = new char[100];
                memset(buf, 0, 512);
                strcpy_P(buf, FPSTR("ERROR: "));
                mbedtls_strerror(ret, error_buf, 100);
                strcat(buf, error_buf);
                ssl_client->_debugCallback(buf);
                delete[] error_buf;
            }
            return handle_error(ret);
        }
    }
    else if (pskIdent != NULL && psKey != NULL)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: setting up PSK"));
        log_v("Setting up PSK");
        // convert PSK from hex to binary
        if ((strlen(psKey) & 1) != 0 || strlen(psKey) > 2 * MBEDTLS_PSK_MAX_LEN)
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(FPSTR("ERROR: pre-shared key not valid hex or too long"));
            log_e("pre-shared key not valid hex or too long");
            return -1;
        }
        unsigned char psk[MBEDTLS_PSK_MAX_LEN];
        size_t psk_len = strlen(psKey) / 2;
        for (int j = 0; j < strlen(psKey); j += 2)
        {
            char c = psKey[j];
            if (c >= '0' && c <= '9')
                c -= '0';
            else if (c >= 'A' && c <= 'F')
                c -= 'A' - 10;
            else if (c >= 'a' && c <= 'f')
                c -= 'a' - 10;
            else
                return -1;
            psk[j / 2] = c << 4;
            c = psKey[j + 1];
            if (c >= '0' && c <= '9')
                c -= '0';
            else if (c >= 'A' && c <= 'F')
                c -= 'A' - 10;
            else if (c >= 'a' && c <= 'f')
                c -= 'a' - 10;
            else
                return -1;
            psk[j / 2] |= c;
        }
        // set mbedtls config
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: set mbedtls config"));
        ret = mbedtls_ssl_conf_psk(&ssl_client->ssl_conf, psk, psk_len,
                                   (const unsigned char *)pskIdent, strlen(pskIdent));
        if (ret != 0)
        {
            if (ssl_client->_debugCallback)
            {
                char *error_buf = new char[100];
                memset(buf, 0, 512);
                strcpy_P(buf, FPSTR("ERROR: "));
                mbedtls_strerror(ret, error_buf, 100);
                strcat(buf, error_buf);
                ssl_client->_debugCallback(buf);
                delete[] error_buf;
            }
            log_e("mbedtls_ssl_conf_psk returned %d", ret);
            return handle_error(ret);
        }
    }
    else
    {

        mbedtls_ssl_conf_authmode(&ssl_client->ssl_conf, MBEDTLS_SSL_VERIFY_NONE);
        log_i("WARNING: Use certificates for a more secure communication!");
    }

    if (cli_cert != NULL && cli_key != NULL)
    {

        mbedtls_x509_crt_init(&ssl_client->client_cert);
        mbedtls_pk_init(&ssl_client->client_key);

        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: loading CRT cert"));

        log_v("Loading CRT cert");

        ret = mbedtls_x509_crt_parse(&ssl_client->client_cert, (const unsigned char *)cli_cert, strlen(cli_cert) + 1);
        if (ret < 0)
        {
            if (ssl_client->_debugCallback)
            {
                char *error_buf = new char[100];
                memset(buf, 0, 512);
                strcpy_P(buf, FPSTR("ERROR: "));
                mbedtls_strerror(ret, error_buf, 100);
                strcat(buf, error_buf);
                ssl_client->_debugCallback(buf);
                delete[] error_buf;
            }
            return handle_error(ret);
        }

        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: loading private key"));

        log_v("Loading private key");
        ret = mbedtls_pk_parse_key(&ssl_client->client_key, (const unsigned char *)cli_key, strlen(cli_key) + 1, NULL, 0);

        if (ret != 0)
        {
            return handle_error(ret);
        }

        mbedtls_ssl_conf_own_cert(&ssl_client->ssl_conf, &ssl_client->client_cert, &ssl_client->client_key);
    }

    if (ssl_client->_debugCallback)
        ssl_client->_debugCallback(FPSTR("INFO: setting hostname for TLS session..."));

    log_v("Setting hostname for TLS session...");

    // Hostname set here should match CN in server certificate
    if ((ret = mbedtls_ssl_set_hostname(&ssl_client->ssl_ctx, host)) != 0)
    {
        if (ssl_client->_debugCallback)
        {
            char *error_buf = new char[100];
            memset(buf, 0, 512);
            strcpy_P(buf, FPSTR("ERROR: "));
            mbedtls_strerror(ret, error_buf, 100);
            strcat(buf, error_buf);
            ssl_client->_debugCallback(buf);
            delete[] error_buf;
        }
        return handle_error(ret);
    }

    mbedtls_ssl_conf_rng(&ssl_client->ssl_conf, mbedtls_ctr_drbg_random, &ssl_client->drbg_ctx);

    if ((ret = mbedtls_ssl_setup(&ssl_client->ssl_ctx, &ssl_client->ssl_conf)) != 0)
    {
        if (ssl_client->_debugCallback)
        {
            char *error_buf = new char[100];
            memset(buf, 0, 512);
            strcpy_P(buf, FPSTR("ERROR: "));
            mbedtls_strerror(ret, error_buf, 100);
            strcat(buf, error_buf);
            ssl_client->_debugCallback(buf);
            delete[] error_buf;
        }

