mobizt/ESP32-Mail-Client/src/ssl_client32.cpp
// Verifies certificate provided by the peer to match specified SHA256 fingerprint
bool verify_ssl_fingerprint(sslclient_context32 *ssl_client, const char *fp, const char *domain_name)
{
    // Convert hex string to byte array
    uint8_t fingerprint_local[32];
    int len = strlen(fp);
    int pos = 0;
    for (size_t i = 0; i < sizeof(fingerprint_local); ++i)
    {
        while (pos < len && ((fp[pos] == ' ') || (fp[pos] == ':')))
        {
            ++pos;
        }
        if (pos > len - 2)
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(FPSTR("ERROR: fingerprint too short"));
            log_d("pos:%d len:%d fingerprint too short", pos, len);
            return false;
        }
        uint8_t high, low;
        if (!parseHexNibble(fp[pos], &high) || !parseHexNibble(fp[pos + 1], &low))
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(FPSTR("ERROR: invalid hex sequence"));
            log_d("pos:%d len:%d invalid hex sequence: %c%c", pos, len, fp[pos], fp[pos + 1]);
            return false;
        }
        pos += 2;
        fingerprint_local[i] = low | (high << 4);
    }

    // Get certificate provided by the peer
    const mbedtls_x509_crt *crt = mbedtls_ssl_get_peer_cert(&ssl_client->ssl_ctx);

    if (!crt)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: could not fetch peer certificate"));
        log_d("could not fetch peer certificate");
        return false;
    }

    // Calculate certificate's SHA256 fingerprint
    uint8_t fingerprint_remote[32];
    mbedtls_sha256_context sha256_ctx;
    mbedtls_sha256_init(&sha256_ctx);
    mbedtls_sha256_starts(&sha256_ctx, false);
    mbedtls_sha256_update(&sha256_ctx, crt->raw.p, crt->raw.len);
    mbedtls_sha256_finish(&sha256_ctx, fingerprint_remote);

    // Check if fingerprints match
    if (memcmp(fingerprint_local, fingerprint_remote, 32))
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: fingerprint doesn't match"));
        log_d("fingerprint doesn't match");
        return false;
    }

    // Additionally check if certificate has domain name if provided
    if (domain_name)
        return verify_ssl_dn(ssl_client, domain_name);
    else
        return true;
}

// Checks if peer certificate has specified domain in CN or SANs
bool verify_ssl_dn(sslclient_context32 *ssl_client, const char *domain_name)
{
    log_d("domain name: '%s'", (domain_name) ? domain_name : "(null)");
    std::string domain_name_str(domain_name);
    std::transform(domain_name_str.begin(), domain_name_str.end(), domain_name_str.begin(), ::tolower);

    // Get certificate provided by the peer
    const mbedtls_x509_crt *crt = mbedtls_ssl_get_peer_cert(&ssl_client->ssl_ctx);

    // Check for domain name in SANs
    const mbedtls_x509_sequence *san = &crt->subject_alt_names;
    while (san != nullptr)
    {
        std::string san_str((const char *)san->buf.p, san->buf.len);
        std::transform(san_str.begin(), san_str.end(), san_str.begin(), ::tolower);

        if (matchName(san_str, domain_name_str))
            return true;

        log_d("SAN '%s': no match", san_str.c_str());

        // Fetch next SAN
        san = san->next;
    }

    // Check for domain name in CN
    const mbedtls_asn1_named_data *common_name = &crt->subject;
    while (common_name != nullptr)
    {
        // While iterating through DN objects, check for CN object
        if (!MBEDTLS_OID_CMP(MBEDTLS_OID_AT_CN, &common_name->oid))
        {
            std::string common_name_str((const char *)common_name->val.p, common_name->val.len);

            if (matchName(common_name_str, domain_name_str))
                return true;

            log_d("CN '%s': not match", common_name_str.c_str());
        }

        // Fetch next DN object
        common_name = common_name->next;
    }

    return false;
}

int starttlsHandshake(sslclient_context32 *ssl_client, int port)
{

    int ret = 0;
    size_t msgLen = 100;
    size_t bufLen = 512;
    char *buf = new char[bufLen];
    char *hMsg = new char[msgLen];

    fd_set readset;
    fd_set writeset;
    fd_set errset;

    struct timeval tv;

    FD_ZERO(&readset);
    FD_SET(ssl_client->socket, &readset);
    FD_ZERO(&writeset);
    FD_SET(ssl_client->socket, &writeset);

    FD_ZERO(&errset);
    FD_SET(ssl_client->socket, &errset);

    tv.tv_sec = 1;
    tv.tv_usec = 0;

    ret = lwip_select(ssl_client->socket, &readset, &writeset, &errset, &tv);
    if (ret < 0)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: waiting incoming data failed!"));

        goto starttls_exit;
    }

    ret = read(ssl_client->socket, buf, bufLen);

    if (ret < 0)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: reading incoming data failed!"));
        goto starttls_exit;
    }
    else
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(buf);
    }

    if (port == 587 || port == 25)
    {

        memset(hMsg, 0, msgLen);
        strcpy_P(hMsg, FPSTR("EHLO DUDE\r\n"));
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("INFO: send SMTP command extended HELO"));
        ret = lwip_write(ssl_client->socket, hMsg, strlen(hMsg));

        if (ret < 0)
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(FPSTR("ERROR: send SMTP command failed!"));
            goto starttls_exit;
        }

        ret = lwip_select(ssl_client->socket, &readset, &writeset, &errset, &tv);

        if (ret < 0)
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(FPSTR("ERROR: waiting incoming data failed!"));
            goto starttls_exit;
        }

        memset(buf, 0, bufLen);
        ret = lwip_read(ssl_client->socket, buf, bufLen);

