mobizt/ESP32-Mail-Client/src/ssl_client32.cpp
        if (ret < 0)
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(FPSTR("ERROR: reading incoming data failed!"));
            goto starttls_exit;
        }
        else
        {
            if (ssl_client->_debugCallback)
                ssl_client->_debugCallback(buf);
        }
    }

    memset(hMsg, 0, msgLen);
    strcpy_P(hMsg, FPSTR("STARTTLS\r\n"));
    if (ssl_client->_debugCallback)
        ssl_client->_debugCallback(FPSTR("INFO: send STARTTLS protocol command"));
    ret = lwip_write(ssl_client->socket, hMsg, strlen(hMsg));

    if (ret < 0)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: send STARTTLS protocol command failed!"));
        goto starttls_exit;
    }

    ret = lwip_select(ssl_client->socket, &readset, &writeset, &errset, &tv);

    if (ret < 0)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: waiting incoming data failed!"));
        goto starttls_exit;
    }

    memset(buf, 0, bufLen);
    ret = lwip_read(ssl_client->socket, buf, bufLen);

    if (ret < 0)
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(FPSTR("ERROR: reading incoming data failed!"));
        goto starttls_exit;
    }
    else
    {
        if (ssl_client->_debugCallback)
            ssl_client->_debugCallback(buf);
    }

    delete[] buf;
    delete[] hMsg;

    return 0;

starttls_exit:

    delete[] buf;
    delete[] hMsg;

    return -1;
}
